import time

import google.generativeai as genai

def gemini(prompt, text):
    model_name = 'gemini-1.5-flash'  # Replace with an available model name if needed
    model = genai.GenerativeModel(model_name)
    genai.configure(api_key='AIzaSyB3h0w_rzHYiaFDP6PJ5VqiBw3l8sKF3hA')
    combined =prompt + text
    response = model.generate_content(combined)
    text = response.candidates[0].content.parts[0].text
    return (text)

# prompt = "קח את הטקסט הבא בעברית וקצר אותו, חזור עם טקסט מקוצר על הפרויקט באורך של כ-75 מילים בעברית, הכולל תיאור של מה הם עושים ואיך הם עושים זאת."
# prompt2 = "קח את הטקסט הבא בעברית ושכתב אותו בעברית, חזור עם טקסט על הפרויקט הכולל את הדבר החשוב ביותר, איך הם עושים זאת, והסבר למישהו שמעולם לא שמע על כך לפני כן, בשני משפטים לכל היותר בעברית."
#
# hebrew_text = "נערים ממסגרות חוץ ביתיות בגילאי 15-18.\n ערים המצויים במשבר נקודתי ומסומנים ע\"י אנשי המקצוע כפוטנציאל נשירה- נערים ב'סערה'.\nנערים אשר המסגרת מאמינה בכוחות, בפרופיל ובהתאמה לפעילות המסגרת ככאלו שיאפשרו לו לסיים את התהליך אצלם, בהינתן התמיכה במשבר הספציפי הנוכחי."
# text_example= "הארגון מתמקד בקידום שוויון והשוויון בחברה ובקידום הזכויות של אנשי האוכלוסיה הגאה. דרך מגוון פעילויות ותוכניות, אנו מבצעים פרויקטים המיועדים לשפר את המציאות של אנשי הקהילה, ולתת מענה לצרכיהם הייחודיים. במסגרת פעילותנו, אנו מקדמים דיאלוג והבנה בין אנשים מקהילות שונות, על מנת לייצר סביבה חברתית פתוחה ומקבלת, ולהפחית את הפערים החברתיים והתרבותיים בין האנשים בחברה."
#
#
# print(f"the long phase:"+ gemini(prompt, text_example))
# print(f"the short phase:"+gemini(prompt2, text_example))
#
#
#
#
# reka = """
# יזמית מהתחלה - אורית  מומחית מיומנויות רכות, בעלת ניסיון ביזמות וניהול של מערכות גדולות, צמחה בעולמות הסימולציה הרפואית, משרה מלאה. יזמה, הקימה וניהלה עשרות מרכזי סימולציה ברחבי העולם
#
# COO - יזמית מהתחלה -תמי מומחית בניהול אופרציות גדולות, מומחית הדרכה במיומנויות רכות, צמחה בעולמות העמותות החברתיות, משרה מלאה. בעלת ניסיון בתחום ניהול אופרציות בארגונים חברתיים כגון בראנקו וייס, הדרכה והוראה של מיומנויות תקשורת בינאישיות ועבודת צוות בקריה האקדמית אונו ובפסיפס
# linkedin.com/in/tamihirschyume
#
# CTO - הצטרף כחלק מצוות המייסדים לפני כשלושה חודשים נמהנדס אלקטרוניקה, בוגר ממרם,לשעבר מנהל צוותים ופרויקטים באמזון, משרה מלאה
# linkedin.com/in/nir-zaidman-1568a764
# """
# etgar= """
# 1. כלים לאוכלוסיה הרחבה לקיום שיחות עם אוכלוסיות מגוונות (יהודים/ערבים)
# 2. כלים למנהלים לקיום שיחות שוטפות בעבודה כאשר הנושא של הגיוון התרבותי מכניס את הרגישות של המצב הנוכחי
# 3. שיחות אוורור מתחים ופחדים- המערכת מהווה פלטפורמה אונליין המאפשרת למשתמש לשוחח עם עובד סוציאלי בשיחה מרחוק לאוורור תחושותיו, מחשבותיו, חששותיו למשך 10 דק'. השיחה אישית
# """
# manna= """
# מערכת CUEZ מאפשרת לצלם/להקליט שיחות בין אנשים/עובדים ומנתחת אותם באמצעות AI על פי פרוטוקולים ייעודיים של שיחה אותם מגדירים מראש:
# שיחות אמיתיות המתקיימות אונליין או לא
# סימולציות אנושיות עם שחקנים מקצועיים אונליין
# CUEZ מנתחת את הנקודות הרגישות והמשמעותיות בשיחה, והמשתתף בשיחה מקבל את צילום/הקלטת השיחה עם רגעים מנותחים מסומנים ממש בתוך השיחה, CUEZ מתלווה אל המשתמש בכל שיחה שיבחר מפעם לפעם היכולות משתפרות.
#
# מודל הפעולה:
# הגדרת האוכלוסיות להן נרצה לפתח מיומנות כלשהי: למשל ניהול שיחות עם אוכלוסיות מגוונות
# ניתוח שיחות המצולמות/מוקלטות מכל מקום,בכל זמן, עברית/אנגלית ולכל כמות משתמשים
# ניתוח השיחות באופן מוכוון מטרה, על פי פרוטוקול מובנה: אחיד, מדוייק, מתוקף מהימן
# בניית פרופיל תקשורתי אישי למשתמש המבוסס על ניתוחי השיחות שלו
# ניתוח מגמות של המיומנות של כל משתמשי CUEZ
#
# אין שתי שיחות דומות ותמיד המטרה לקיים שיחה אפקטיבית, CUEZ הוא חבר אישי דיגיטלי המלווה את המשתתף בשיחה ועוזר להגיד בכל שיחה מחדש את הדבר הנכון, באופן הנכון, בזמן הנכון
#
# התוצאה הרצויה
# במיקרו - מיצוי הפוטנציאל השיחתי של כל משתמש עד שהמיומנות תהפוך אצלו לטבע שני. המערכת מזהה חולשות וחוזקות של כל דובר ומקדמת אותו במרכיב שמתאים לו.
# במאקרו - שיפור של כל המשתמשים, מוביל בהכרח לתרבות סובלנית ,מיומנות גבוה, יותר שיחות אפקטיביות, ופחות שיחות קונפליקטואליות.
# """
#
#
prompt1 = "קח את הטקסט הבא בעברית וסכם את הרקע של היזם/יזמים למשפט אחד."
prompt2 = "קח את הטקסט הבא בעברית וסכם את האתגר הספציפי שהמיזם מנסה לפתור בשני משפטים."
prompt3 = "קח את הטקסט הבא בעברית ותאר כיצד המיזם נותן מענה לאתגר הספציפי בשני משפטים."
prompt4 = "קח את התשובות מהטקסטים הבאים וכתוב סיכום על המיזם באורך של עד 75 מילים. תן דגש לקראת הסוף לדרך הפעולה במיזם"

#
# reka_answer= gemini(prompt1, reka)
# etgar_answer= gemini(prompt2, etgar)
# manna_answer= gemini(prompt3, manna)
# time.sleep(5)
# summary= gemini(prompt4,reka_answer + etgar_answer + manna_answer)
# print(f"the Reka phase:"+ reka_answer)
# print(f"the Etgar phase:"+ etgar_answer)
# print(f"the Manna phase:"+ manna_answer)
# print(f"the Summary  phase:"+ summary)



